Put readme and add c4
